3193	黙示護聖ファル・ピエロ	0	20,12	1500	3			
2525	「無情」の極 シャングリラ	5	12,125	17000	11	1,8	19,5	2
2537	無情秘伝 LOVE×HATE	5	0		9			
2551	墓地の守護者メガギョロン	5	12	1000	5		1	
2467	「破滅」の頂 ユートピア・エヴァー	5	12,120,125	17000	12		1,5	
2791	愛々の守護者チョップルン	0	12	4000	3		1	
247	雷鳴の守護者ミスト・リエス	0	12	2000	5			
1165	ペトリアル・フレーム	0	1		3			
2339	フォーチュン・スロット	1	0		4			1
1093	セブンス・タワー	4	0		3		16	
2606	母なる星域	4	0		3			
1229	ノーブル・エンフォーサー	1	1		4			
382	聖域の守護者フォボス・エレインγ	0	12,2	4000	6		4	
3307	ドンドン吸い込むナウ	1	0		4			1
3268	超次元ホワイトグリーン・ホール	0,4	0		4		12	
3660	ガンヴィート・ブラスター	2	0		7			
4033	支配のオラクルジュエル	0,2	0		8		12	1
2746	拷問ロスト・マインド	2	0		4			
3444	再誕の社	4	0		3			
3410	リーフストーム・トラップ	4	0		4			1
3895	墓守の鐘ベルリン	0,2	10,48,109	3000	2		12,1	
1126	パクリオ	1	28	1000	4			
3518	時空の踊り子マティーニ	1	103,30	1000	3		1	
3439	時空の花カイマン	4	103,75	5000	5			4
3440	華獣の覚醒者アリゲーター	4	103,75	8000	10		3	2
3519	舞姫の覚醒者ユリア・マティーナ	0	103,18	3000	6		1	5
1659	光波の守護者テルス・ルース	0	12	2500	2		1	
3113	ガロウズ・セブ・カイザー	1	103,99,107	6000	6		3	8
4263	魂の大番長「四つ牙」	4	75,103,109	6000	6		3	
4229	激沸騰！オンセン・ガロウズ	1,3	99,103,104,107	6000	7		3	
3174	死海竜ガロウズ・デビルドラゴン	1,2,3	119,111,107	12000	24		5	2
4230	絶対絶命 ガロウズ・ゴクドラゴン	0,1,2,3,4	119,107,110	17000	30		5	2
4264	バンカラ大親分 メンチ斬ルゾウ	3,4	75,109,119	17000	24		5	
3525	時空の喧嘩屋キル	3	103,58	1000	2			9
4258	不死身のブーストグレンオー	3	93,103,109	6000	7		3	
3365	時空の火焔ボルシャック・ドラゴン	3	103,50	6000+	7		3	
3526	巨人の覚醒者セツダン	4	103,68	5000+	7		3	
4260	爆裂ダッシュ！グレンセーバー政	3,4	75,93,109,119	12000+	15		5	
3366	勝利の覚醒者ボルシャック・メビウス	3	103,50	12000+	14		5	2
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
