3227	霞み妖精ジャスミン	4	70	1000	2			
2740	ヒラメキ・プログラム	1	0		3			
2783	八面の化身	4	77,107	5000	8			
2912	勝利宣言鬼丸「覇」	3	58,108,109,107	9000+	10		6,5	2
2982	偽りの王 ヴィルヘルム	2,3,4	112,120	12000	9		5,12	
481	フェアリー・ライフ	4	0		2			1
2200	ニンプウ・タイフーン	3	0		2			
2778	オニウッカリ 爆マル	3	58,109,107	3000	8		6	
2834	無双竜鬼ミツルギブースト	3,4	66,50,109	5000	5		12	
2765	アクア・ライブラリアン	1	35,109	4000	8			
4093	一撃奪取 ブラッドレイン	2	124	1000	2			
3621	悪魔神グレイトフル・デッド	2	41	11000	7	1	3	
2579	ピクシー・ライフ	4	0		2			
3107	サイバー・N・ワールド	1	99	6000	6		3	
2914	「祝」の頂 ウェディング	5	120,125	13000	11		34,5	
4219	正々堂々 ホルモン	4	132	1000	3			
2468	「修羅」の頂 VAN・ベートーベン	5	112,120,125	14000	11		5	
4036	飛散する斧 プロメテウス	1,4	124	1000	5		12	
3476	超次元ボルシャック・ホール	3	0		5			
4313	強奪者 テラフォーム	1,4	124	2000	5		12	
2752	めった切り・スクラッパー	3	0		7			1
2713	「智」の頂 レディオ・ローゼス	5	120,125	17000	10		5	
3930	ボルバルザーク・エクス	3,4	50,66,109	6000	7		3,6,12	
1091	フェアリー・ギフト	4	0		1			
2976	黄金龍 鬼丸「王牙」	5	108,125,109	13000	11		5,6	
79	青銅の鎧	4	75	1000	3			
924	緑神龍ザールベルグ	4	66	5000	9			
2298	超銀河弾 HELL	3	0,89		10			
1474	緑神龍ミルドガルムス	4	66	5000	7			
1954	龍神メタル	3	84,50	7000＋	7		3	
4300	フェアリー・シャワー	1,4	0		4		12	1
1171	バジュラズ・ソウル	3	1		5			2
3155	イオの伝道師ガガ・パックン	0	103,17,107	3000	4			9
3525	時空の喧嘩屋キル	3	103,58	1000	2			9
4258	不死身のブーストグレンオー	3	93,103,109	6000	7		3	
3365	時空の火焔ボルシャック・ドラゴン	3	103,50	6000+	7		3	
3526	巨人の覚醒者セツダン	4	103,68	5000+	7		3	
4260	爆裂ダッシュ！グレンセーバー政	3,4	75,93,109,119	12000+	15		5	
3366	勝利の覚醒者ボルシャック・メビウス	3	103,50	12000+	14		5	2
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
