ろろじ48980<>コメがw<>message1<>
ろろじ48980<>あー<>message1<>
ろろじ48980<>大変そうなんでいいですw<>message1<>
ろろじ48980<>大変そうなんでいいですw<>message1<>
ろろじ48980<>あー<>message1<>
ロリーティオ☆<>トーナメントの勝利有無問わず、雰囲気だけｗ<>admin<>
ロリーティオ☆<>どうしても対戦したいのなら、二刀流でもｗ<>admin<>
ろろじ48980<>まぁラッキー？w<>message1<>
ロリーティオ☆<>そんな感じかなｗ<>admin<>
ろろじ48980<>シード的な感じか？w<>message1<>
ろろじ48980<>えーと<>message1<>
<>一度退室しないと、再度対戦することはできません。<>system<>
<>2ターン以内の投了・無断退室では勝敗数とポイントは記録されません。<>system<>
<>ろろじ48980の勝ち！<>system<>
<>schwarzさんが投了しました。<>system<>
schwarz<>サブ垢ですｗ　頑張ってくださいｗ<>message2<>
<>schwarzのターン！<>system<>
<>Fantasia　Festa　tournament、開始！<>system<>
