959	無双恐皇ガラムタ	2,4	40,66	5000	6		12,15	
1592	魔龍バベルギヌス	2	44,38	1000	7			
3246	ボルシャック・スーパーヒーロー	3	50,109	6000	6		3	
3069	黒神龍オドル・ニードル	2	44	5000	6			1
3618	エコ・アイニー	4	59	2000	4			
3045	メンデルスゾーン	3,4	0		2		12	
1888	無双竜機ボルグレス・バーズ	3,4	50,66	8000	7		12,3	
1563	超竜バジュラズテラ	3	50	12000	9	3	5	
3232	永遠のリュウセイ・カイザー	3	108,109	8000	8		3	
3364	黒神龍エンド・オブ・ザ・ワールド	2	44	7000	7		3	
2535	R.S.F.K.	3	108,109,107	5000	7		6	2
2839	偽りの王 カンタービレ	2,4	112,120	9000	9		3,12	
3435	シンカゲリュウ・柳生・ドラゴン	3	50,88	5000	5			
2840	偽りの王 モーツァルト	2,3,4	112,120	17000	11		5,12	
4465	フレフレ・ピッピー	3	59,93	1000	3			
3887	ガイアール・アバレ・カイザー	3	108,109	7000	6		3	
3312	永遠のプリンプリン	4	107,109	4000	4			
3036	フエッピ・サンナン	4	59,109	4000	4			
2708	オフコース・カイザー 「龍」	3	108,109	6000	6			
4464	ゴーオン・ピッピー	3	109,59	1000	3			
4251	ガイアール・ゼロ	3	108,109	7000	6		3	
3248	狩猟のガイア・エッグ	4	113	1000	3			9
3293	流星のフォーエバー・カイザー	3	103,108,109	6000	6		3	
3264	大関 地男の里	4	103,78,107	2000	3			9
3343	星龍王ガイアール・リュウセイドラゴン	3	119,112,109	19000	20		5	2
3265	雲龍 ディス・イズ・大横綱	2,3,4	119,115,107	20000	20		32	
1659	光波の守護者テルス・ルース	0	12	2500	2		1	
3113	ガロウズ・セブ・カイザー	1	103,99,107	6000	6		3	8
4263	魂の大番長「四つ牙」	4	75,103,109	6000	6		3	
4229	激沸騰！オンセン・ガロウズ	1,3	99,103,104,107	6000	7		3	
3174	死海竜ガロウズ・デビルドラゴン	1,2,3	119,111,107	12000	24		5	2
4230	絶対絶命 ガロウズ・ゴクドラゴン	0,1,2,3,4	119,107,110	17000	30		5	2
4264	バンカラ大親分 メンチ斬ルゾウ	3,4	75,109,119	17000	24		5	
3525	時空の喧嘩屋キル	3	103,58	1000	2			9
4258	不死身のブーストグレンオー	3	93,103,109	6000	7		3	
3365	時空の火焔ボルシャック・ドラゴン	3	103,50	6000+	7		3	
3526	巨人の覚醒者セツダン	4	103,68	5000+	7		3	
4260	爆裂ダッシュ！グレンセーバー政	3,4	75,93,109,119	12000+	15		5	
3366	勝利の覚醒者ボルシャック・メビウス	3	103,50	12000+	14		5	2
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
