3460	超次元エナジー・ホール	1	0		5			
2187	光牙忍ハヤブサマル	0	12,95	3000	3		31	
1934	霊王機エル・カイオウ	0,1	9,23	4500	2		12,1	
115	スパイラル・ゲート	1	0		2			1
171	ロジック・キューブ	0	0		3			1
3452	超次元シャイニー・ホール	0	0		5			
2117	氷牙フランツ１世	1	28,89	2000	3			
2055	魔光王機デ・バウラ伯	0	23,89	4000	4		1	
468	エナジー・ライト	1	0		3			
3517	超次元ドラヴィタ・ホール	0	0		5			
3024	スパイラル・スライダー	1	0		2			1
1917	光陣の使徒ムルムル	0	10	2000	2		1	
3096	王機聖者ミル・アーマ	0,1	23,10	3000	3		1,12	
4018	ボーンおどり・チャージャー	2	0		3			
1891	暗黒導師ブラックルシファー	2	41	6000＋	6		3	
104	デーモン・ハンド	2	0		6			1
472	邪魂転生	2	0		3			1
4472	絶望の悪魔龍　フューチャレス	2	41	6000	6		3	
3903	炎獄デス・サンライズ	2	0		6			
1028	暗黒秘宝ザマル	2	46	2000＋	3			2
1198	解体人形ジェニー	2	42	1000	4			
4355	復讐のバイス・カイザーZ	2	107,118	6000	7		3	
1827	魔刻の斬将オルゼキア	2	41	6000	7		3	
102	ゴースト・タッチ	2	0		2			1
3245	地獄門デス・ゲート	2	0		6			1
4471	悪魔龍王　デストロンリー	2	41	9000	8	8	3	
4473	リュウセイ・イン・ザ・ダーク	2	118	8000	8		3,9	
3514	時空の英雄アンタッチャブル	0	103,80	1000	2			
4239	ホワイト・TENMTH・カイザー	0	103,117,107	6000	7		3	2
4287	時空のガガ・シリウス	0	103,11,107	12500	7		1	
3595	時空の霊魔シュヴァル	0,2	103,11,41	4500	5			
3596	霊魔の覚醒者シューヴェルト	0,2	103,11,41	6500	12		3	
4240	シャチホコ・GOLDEN・ドラゴン	0,2,3	119,112,107	39000	39			2
4288	時空のセブ・ランサー	1	103,35,107	5000	7			
3515	変幻の覚醒者アンタッチャブル・パワード	1	103,99	5000	7		2	
3356	時空の雷龍チャクラ	0	103,82	5500	7		1	9
3640	時空の凶兵ブラック・ガンヴィート	2	103,41	5000	7			
3489	時空の封殺ディアス Z	2	103,41,44	7000	8		3	2
3182	タイタンの大地ジオ・ザ・マン	4	103,100,107	5000	6			
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
