3231	狼虎サンダー・ブレード	2	41,109	7000	7		3	
1040	悪魔神ドルバロム	2	41	13000	10	1	5	
1947	腐敗無頼トリプルマウス	2,4	39,75	2000	5		12	
1730	炎獄の剛魔ビルギアス	2	41	1000	5		27	
3988	クアトロ・ブレイン	1	0		6			
2153	威牙の幻ハンゾウ	2	41,95	5000	7		31	
176	ロスト・ソウル	2	0		7			
1203	漆黒戦鬼デュランザメス	2	41	12000	12		5,18	
3484	超次元フェアリー・ホール	4	0		5			
3935	ゲロ NICE・ハンゾウ	2	41,109	5000	7			
3505	終焉の凶兵ブラック・ガンヴィート	2	41	7000+	7		5	2
716	冥府の覇者ガジラビュート	2	41	3000	6			
2177	凶刻の刃狼ガル・ヴォルフ	2	41	6000	6		3	
3992	減退の魔将スクリューマー	2	41	7000	6		3	
841	英知と追撃の宝剣	1,2	0		7		12	
2400	爆進イントゥ・ザ・ワイルド	4	0		6			
956	悪魔聖霊バルホルス	0,2	11,41	6000	8		1,12	
2223	魔光騎聖ブラッディ・シャドウ	0,2	10,39,89	4500	2		12,1,18	
2146	奇跡の精霊ミルザム	0	11	11000	9		1,3	
2527	「十尾」の頂 バック・トゥ・ザ・オレ	5	11,125	11000	10		3	2
315	天海の精霊シリウス 	0	11	12000	11		1,5	
3116	雷神の求道者センジュ	0	19	6000	6		1	
2236	無敵城シルヴァー・グローリー	0	96		6			
1176	巡霊者ウェビウス	0	14	1000	2		1,18	
1318	平和の守護者メ・フューサー	0	12	4000	5		1	
0	蒼天の守護者ラ・ウラ・ギガ	0	12	2000	1		1	
1659	光波の守護者テルス・ルース	0	12	2500	2		1	
3113	ガロウズ・セブ・カイザー	1	103,99,107	6000	6		3	8
4263	魂の大番長「四つ牙」	4	75,103,109	6000	6		3	
4229	激沸騰！オンセン・ガロウズ	1,3	99,103,104,107	6000	7		3	
3174	死海竜ガロウズ・デビルドラゴン	1,2,3	119,111,107	12000	24		5	2
4230	絶対絶命 ガロウズ・ゴクドラゴン	0,1,2,3,4	119,107,110	17000	30		5	2
4264	バンカラ大親分 メンチ斬ルゾウ	3,4	75,109,119	17000	24		5	
3525	時空の喧嘩屋キル	3	103,58	1000	2			9
4258	不死身のブーストグレンオー	3	93,103,109	6000	7		3	
3365	時空の火焔ボルシャック・ドラゴン	3	103,50	6000+	7		3	
3526	巨人の覚醒者セツダン	4	103,68	5000+	7		3	
4260	爆裂ダッシュ！グレンセーバー政	3,4	75,93,109,119	12000+	15		5	
3366	勝利の覚醒者ボルシャック・メビウス	3	103,50	12000+	14		5	2
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
