4074	剛厳の使徒シュライバー	0	10,109	3000	3			
1579	封魔ゴーゴンシャック	1	38	2000	3			
1975	聖鎧亜クイーン・アルカディアス	0,2	85,11	9000	6	2	12,3	
1936	腐敗聖者ベガ	0,2	10,39	2000	5		12	
2514	デュエマの鬼！キクチ師範代	2	58	3000	3			
3003	瞬封の使徒サグラダ・ファミリア	0	10,109	1500	2			
2315	至宝 オール・イエス	0,2	1,88		2		12	2
3920	セブ・コアクマン	1	28,107	2000	4			
3713	ミスター・アクア	0,1	35,109	3500	6		1,12	1
1451	百発人形マグナム	2	42	4000	4			
1923	猛菌恐皇ビューティシャン	1,2	25,40	1000	2		12,1,27	
2775	虚構の影バトウ・ショルダー	2	39	2000	3			
4194	禁術のカルマ カレイコ	2	122	3000	3			
1952	龍神ヘヴィ	2	84,44	5000＋	5			
840	陰謀と計略の手	1,2	0		4		12	
1679	埋め立てロボ・コンクリオン	1	23	1000	2			
838	魂と記憶の盾	0,1	0		3		12	
320	アクア・サーファー	1	35	2000	6			1
982	天使と悪魔の墳墓	0,2	0		4		12	1
2772	希望の親衛隊ファンク	2	40,109,107	5000	5			
3794	超次元ミカド・ホール	2	0		5			
1586	封魔ヴィネス	2	38	1000	3			
1026	停滞の影タイム・トリッパー	2	39	1000	3			
418	超幻獣グラザルド	2	37	5000	5	1		
3904	戦略のD・H（デュエルヒーロー） アツト	1,2	58,126	2000	2		12	
1194	ギガザンダ	2	37	1000	2		17	4
3468	超次元リバイヴ・ホール	2	0		5			
3166	コアクアンのおつかい	1	0		3			
2192	斬隠テンサイ・ジャニット	1	28,95	1000	3		31	
866	ギガバルザ	2	37	1000	4			1
2383	爆進エナジー・スパイラル	1	0		4			
3164	超次元ガロウズ・ホール	1	0		6			
780	魔天降臨	2	0		6			1
4241	時空の不滅ギャラクシー	0	103,11	5000	7			
3487	時空の精圧ドラヴィタ	0	103,11	5500	7			9
3356	時空の雷龍チャクラ	0	103,82	5500	7		1	9
3640	時空の凶兵ブラック・ガンヴィート	2	103,41	5000	7			
3489	時空の封殺ディアス Z	2	103,41,44	7000	8		3	2
3182	タイタンの大地ジオ・ザ・マン	4	103,100,107	5000	6			
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
