4117	神聖麒 シューゲイザー	5	130	7000	7		3	2
3750	ウソと盗みのエンターテイナー	2,3	58,40	4000	4		12	
1865	鎧亜の咆哮キリュー・ジルヴェス	2,3,4	85	1000	5		12	
3879	神聖斬 アシッド	5	130	6000	7		1,3	
3790	逆転王女プリン	5	107,109	2000	5			1
3222	次元流の豪力	4	75,107	2000	5			
3148	超次元ガイアール・ホール	3	0		6			
844	焦土と開拓の天変	3,4	0		5		12	
1276	天真妖精オチャッピィ	4	70	1000	3			6
3325	カモン・ピッピー	3	59,109	1000	5			
2370	宇宙巨匠ゼノン・ダヴィンチ	4	68,72,97	9000	11	1	3	
967	剛撃戦攻ドルゲーザ	4,1	22,68	9000	8		3,12,15	
3615	絢爛の超人	4	68	5000	7			
2397	奇兵の超人	4	68,88	3000	6			
2330	西南の超人	4	68,88	3000	4			
2306	蒼狼の始祖アマテラス	1	89,88,97	5000	6			
3559	剛撃無双カンクロウ	4	66,68,88	19000	9		32	
3497	剛撃無双グリーン・バルト	4	68,66	9000	7		3	
786	ネオ・ブレイン	1	0		4			1
778	転生プログラム	1	0		3			1
3173	ハイドラ・ギルザウルス	3	103,65,107	5000	5			
3647	時空の役者カンクロウ	4	103,66,68,88	6000	7		3	
3368	時空の豪腕ジャパン	4	103,68	6000	7		3	9
3369	乱打の覚醒者ジャパニカ	4	103,68	17000	14		5	
3648	大見得の覚醒者ジャングル・カンクロウ	4	103,66,68,88	17000	11		5	
0	蒼天の守護者ラ・ウラ・ギガ	0	12	2000	1		1	
1659	光波の守護者テルス・ルース	0	12	2500	2		1	
3113	ガロウズ・セブ・カイザー	1	103,99,107	6000	6		3	8
4263	魂の大番長「四つ牙」	4	75,103,109	6000	6		3	
4229	激沸騰！オンセン・ガロウズ	1,3	99,103,104,107	6000	7		3	
3174	死海竜ガロウズ・デビルドラゴン	1,2,3	119,111,107	12000	24		5	2
4230	絶対絶命 ガロウズ・ゴクドラゴン	0,1,2,3,4	119,107,110	17000	30		5	2
4264	バンカラ大親分 メンチ斬ルゾウ	3,4	75,109,119	17000	24		5	
3525	時空の喧嘩屋キル	3	103,58	1000	2			9
4258	不死身のブーストグレンオー	3	93,103,109	6000	7		3	
3365	時空の火焔ボルシャック・ドラゴン	3	103,50	6000+	7		3	
3526	巨人の覚醒者セツダン	4	103,68	5000+	7		3	
4260	爆裂ダッシュ！グレンセーバー政	3,4	75,93,109,119	12000+	15		5	
3366	勝利の覚醒者ボルシャック・メビウス	3	103,50	12000+	14		5	2
4233	勝利のリュウセイ・カイザー	1,2,3	103,108,109	6000	6		3	
4234	勝利のガイアール・カイザー	2,3,4	103,108,109	5000	7		6,9	
3259	サンダー・ティーガー	2	103,41,109	3000	5			9
3235	ヴォルグ・サンダー	2	103,41,109	7000	6		3	
4235	勝利のプリンプリン	0,1,4	103,107,109	4000	5			
4243	アクア・アタック＜BAGOOON・パンツァー＞	0,1	103,35,109	6000	7		3	
3260	雷獣ヴォルグ・ティーガー	2	119,41,109	11000	12		3	2
4236	唯我独尊ガイアール・オレドラゴン	0,1,2,3,4	109,110,119	26000+	30		6	
3357	雷電の覚醒者グレート・チャクラ	0	103,82	13500	14		1,5	
3488	龍圧の覚醒者ヴァーミリオン・ドラヴィタ	0,3	103,11,50	12000	14		5	
3183	貪欲バリバリ・パックンガー	0,4	119,100,17,107	10500	15		3	8
4242	撃滅の覚醒者キング・オブ・ギャラクシー	0	103,11	11500	9		3	
4246	弩級合身！ジェット・カスケード・アタック	0,1	119,35,109	17000	24		5	2
3641	凶刀の覚醒者ダークネス・ガンヴィート	2	103,41	9000	13		3	2
3490	殲滅の覚醒者ディアボロス Z	2	103,41	18000	16		32	
