# ÉÇÉWÉÖÅ[ÉãêÈåæ/ïœêîèâä˙âª
use strict;
my %cf;
#Ñ°ÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑü
#Ñ† DAY COUNTER-EX : init.cgi - 2011/10/07
#Ñ† Copyright (c) KentWeb
#Ñ† http://www.kent-web.com/
#Ñ§ÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑü
$cf{version} = 'DayX v4.2';
#Ñ°ÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑü
#Ñ† [íçà”éñçÄ]
#Ñ† 1. Ç±ÇÃÉXÉNÉäÉvÉgÇÕÉtÉäÅ[É\ÉtÉgÇ≈Ç∑ÅBÇ±ÇÃÉXÉNÉäÉvÉgÇégópÇµÇΩ
#Ñ†    Ç¢Ç©Ç»ÇÈëπäQÇ…ëŒÇµÇƒçÏé“ÇÕàÍêÿÇÃê”îCÇïâÇ¢Ç‹ÇπÇÒÅB
#Ñ† 2. ê›íuÇ…ä÷Ç∑ÇÈéøñ‚ÇÕÉTÉ|Å[Égåfé¶î¬Ç…Ç®äËÇ¢Ç¢ÇΩÇµÇ‹Ç∑ÅB
#Ñ†    íºê⁄ÉÅÅ[ÉãÇ…ÇÊÇÈéøñ‚ÇÕàÍêÿÇ®éÛÇØÇ¢ÇΩÇµÇƒÇ®ÇËÇ‹ÇπÇÒÅB
#Ñ§ÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑüÑü
#
# [ É^ÉOÇÃèëÇ´ï˚ÇÃó· ]
#   ëçÉJÉEÉìÉgêî     <img src="count/dayx.cgi?gif">
#   ñ{ì˙ÇÃÉJÉEÉìÉgêî <img src="count/dayx.cgi?today">
#   çì˙Å@Å@ÅV	     <img src="count/dayx.cgi?yes">

#===========================================================
# Å° ê›íËçÄñ⁄
#===========================================================

# âÊëúòAåãÉÇÉWÉÖÅ[Éã
# 0 : gifcat.pl
# 1 : Image-MagickÅiÉTÅ[ÉoÇ…ÉCÉìÉXÉgÅ[ÉãÇ≥ÇÍÇƒÇ¢ÇÈïKóvÇ†ÇËÅj
$cf{image_pm} = 0;

# ó›åvÉJÉEÉìÉgç≈í·åÖêî
$cf{digit1} = 6;

# ñ{/çì˙ÉJÉEÉìÉgç≈í·åÖêî
$cf{digit2} = 4;

# ó›åvÉtÉ@ÉCÉãÅyÉTÅ[ÉoÉpÉXÅz
$cf{logfile} = "./data/dayx.dat";

# çì˙/ñ{ì˙ÉtÉ@ÉCÉãÅyÉTÅ[ÉoÉpÉXÅz
$cf{yesfile} = "./data/yes.dat";
$cf{todfile} = "./data/today.dat";

# ì˙éüãLò^ÉtÉ@ÉCÉãÅyÉTÅ[ÉoÉpÉXÅz
$cf{dayfile} = "./data/day.dat";

# åééüãLò^ÉtÉ@ÉCÉãÅyÉTÅ[ÉoÉpÉXÅz
$cf{monfile} = "./data/mon.dat";

# ÉeÉìÉvÉåÅ[ÉgÉfÉBÉåÉNÉgÉä
$cf{tmpldir} = './tmpl';

# ó›åvÉJÉEÉìÉgGIFâÊëúÉfÉBÉåÉNÉgÉäÅyÉTÅ[ÉoÉpÉXÅz
$cf{gifdir1} = "./gif1";

# ñ{/çì˙ÉJÉEÉìÉgGIFâÊëúÉfÉBÉåÉNÉgÉäÅyÉTÅ[ÉoÉpÉXÅz
$cf{gifdir2} = "./gif2";

# ÉJÉEÉìÉ^ÇÃã@î\É^ÉCÉv
# 0 : ëçÉJÉEÉìÉgêîïsóvÅiçì˙Å^ñ{ì˙ÇÃÇ›Åj
# 1 : ïWèÄÉ^ÉCÉv
$cf{type} = 1;

# IPÉAÉhÉåÉXÇÃìÒèdÉJÉEÉìÉgÉ`ÉFÉbÉN
# 0 : É`ÉFÉbÉNÇµÇ»Ç¢
# 1 : É`ÉFÉbÉNÇ∑ÇÈ
$cf{ip_check} = 0;

# èWåvàÍóóÇ©ÇÁÇÃñﬂÇËêÊ
$cf{home} = "../index.php";

# ÉOÉâÉtâÊëúÅyURLÉpÉXÅz
$cf{graph1} = "./img/blue.gif";
$cf{graph2} = "./img/red.gif";

# åéä‘ÉOÉâÉtïùÇÃí≤êÆ
# 1Ç©åéïΩãœ 4åÖÇ≈50Å`100  5åÖÇ≈200Å`500íˆìx
$cf{mKEY} = 50;

# ì˙åvÉOÉâÉtïùÇÃí≤êÆ
# 1ì˙ïΩãœ 2åÖÇ≈1Å`3  3åÖÇ≈5Å`10  4åÖÇ≈30Å`60íˆìx
$cf{dKEY} = 1;

# gifcat.plÇÃÉpÉXÅyÉTÅ[ÉoÉpÉXÅz
$cf{gifcat_pl} = './lib/gifcat.pl';

# magick.plÇÃÉpÉXÅyÉTÅ[ÉoÉpÉXÅz
$cf{magick_pl} = './lib/magick.pl';

#===========================================================
# Å° ê›íËäÆóπ
#===========================================================

# ê›íËílÇï‘Ç∑
sub init {
	return %cf;
}


1;

